// Copyright 2021 Anatoli Kucharau https://vk.com/ulvprog. All Rights Reserved.

/**
 * Управляет титулами игрока. Белорусский язык. Титулы зависят от количества очков и динамически вычисляются из количества очков.
 */

namespace Viktorina.Bot.Stats
{
	public class TitlesControlBelorussian : TitlesControlParent
	{
		public TitlesControlBelorussian()
		{
			title0 = "адмоўны баланс";
			title1 = "рэдкі госць";
			title2 = "госць";
			title3 = "навік";
			title4 = "пачатковец";
			title5 = "вучань";
			title6 = "салага";
			title7 = "батан";
			title8 = "студэнт";
			title9 = "свежая галава";
			title10 = "перспектыўны";
			title11 = "змыслы";
			title12 = "знавец";
			title13 = "вундэркінд";
			title14 = "бакалаўр";
			title15 = "які налаўчыўся";
			title16 = "доктар";
			title17 = "усёведны";
			title18 = "прафесар";
			title19 = "магістр";
			title20 = "майстар";
			title21 = "мудры";
			title22 = "гуру";
			title23 = "заўсёднік";
			title24 = "толькі паглядзіце";
			title25 = "хаджалы";
			title26 = "у даеш!";
			title27 = "паспяховы";
			title28 = "расту над сабой";
			title29 = "разумнік-разумнік";
			title30 = "кібермозг";
			title31 = "словапантаны";
			title32 = "калекцыянер літар";
			title33 = "гучнае імя";
			title34 = "бач як насабачыўся";
			title35 = "тонкі адмысловец";
			title36 = "рэдкі майстар";
			title37 = "у самым росквіце сіл";
			title38 = "ас клавішнай самаробкі";
			title39 = "змаганец з энтрапіяй";
			title40 = "далей - больш";
			title41 = "бываюць жа такія";
			title42 = "прафесіянал";
			title43 = "рызыковы шматавед";
			title44 = "успамінальнік-разуменщык";
			title45 = "дзівы без рэшата";
			title46 = "вязень чату";
			title47 = "назапасіў у мільярд словаў";
			title48 = "успрымальны";
			title49 = "лексічны зомбі";
			title50 = "спрытны клавішнік";
			title51 = "і жняяр і кравец";
			title52 = "амёба Паўлік";
			title53 = "прыкуты да крэсла";
			title54 = "і не нам супакою";
			title55 = "шматрукае дзіва";
			title56 = "кат бота";
			title57 = "НЛА";
			title58 = "вянок пастэвалюцыі";
			title59 = "на паўдарозе";
			title60 = "чуйны розум";
			title61 = "рэактыўны унікум";
			title62 = "сур'ёзны аўтарытэт";
			title63 = "лінгваталент";
			title64 = "галава на плячах";
			title65 = "агульны гонар";
			title66 = "майстэрскі мовазнаўца";
			title67 = "ігрок нон-стоп";
			title68 = "шалёны ботаед";
			title69 = "нястомленые пальцы";
			title70 = "друкавальны цэладзённае";
			title71 = "валадар слоўнікаў";
			title72 = "адно слова - мастак";
			title73 = "сапраўдны монстр";
			title74 = "бездакорны мысляр";
			title75 = "паглынальнік ведаў";
			title76 = "агент наасферы";
			title77 = "невылечны гульняман";
			title78 = "вербальны гурман";
			title79 = "сканар з памяццю слана";
			title80 = "аналітычнае сховішча";
			title81 = "узломшчык рэальнасці";
			title82 = "пазаземны розум";
			title83 = "агент матрыцы";
			title84 = "энцыклапедаед";
			title85 = "асацыяцыйны біячып";
			title86 = "філалагічны мнемонік";
			title87 = "дзіцё інфаэры";
			title88 = "петабайтагаловы";
			title89 = "тыран нейронаў";
			title90 = "фатонны працэсар";
			title91 = "сакрэтная распрацоўка";
			title92 = "імгненны клавабой";
			title93 = "анёл віктарыны";
			title94 = "вялікі дух спазнання";
			title95 = "сусветная свядомасць";
			title96 = "загадкавая глыбакадумная субстанцыя";
			title97 = "камбінатар сэнсаў";
			title98 = "залімітавы таленціска";
			title99 = "які зашкаліў інтэлект";
			title100 = "IQ-бомба";
			title101 = "клон Эйнштэйна";
			title102 = "найвысокі эталон розуму";
			title103 = "унікальная з'ява";
			title104 = "неверагодны мазгалом";
			title105 = "невытлумачальны феномен";
			title106 = "класік віктарынізма";
			title107 = "гераічны эрудыт";
			title108 = "набытак віктарыны";
			title109 = "геній гульні";
		}

		private static TitlesControlParent current;
		public static TitlesControlParent GetCurrent()
		{
			if (current == null)
			{
				current = new TitlesControlBelorussian();
			}
			return current;
		}


		//end of class
	}
}

/*
 * 110
отрицательный баланс
редкий гость
гость
новичок
начинающий
ученик
салага
ботан
студент
свежая голова
перспективный
смекалистый
знаток
вундеркинд
бакалавр
наловчившийся
доктор
всезнающий
профессор
магистр
мастер
мудрец
гуру
завсегдатай
только посмотрите
бывалый
во даешь!
успешный
расту над собой
умник-разумник
кибермозг
словодержимый
коллекционер букв
громкое имя
ишь как насобачился
тонкий специалист
редкий дока
в самом расцвете сил
ас клавишного рукоделия
борец с энтропией
дальше - больше
бывают же такие
профессионал
азартный многовед
вспоминатель-пониматель
чудеса без решета
узник чата
запас в миллиард слов
восприимчивый
лексический зомби
сноровистый клавишник
и жнец и швец
амёба Павлик
прикованный к стулу
и нет нам покоя
многорукое чудо
мучитель бота
НЛО
венец постэволюции
на полпути
чуткий ум
реактивный уникум
серьезный авторитет
лингвоталант
голова на плечах
общая гордость
искусный словесник
игрок нон-стоп
бешеный ботоед
безустальные пальцы
печатающий круглосуточно
владыка словарей
одно слово - мастак
настоящий монстр
безупречный мыслитель
поглотитель знаний
агент ноосферы
неизлечимый игроман
вербальный гурман
сканер с памятью слона
аналитическое хранилище
взломщик реальности
внеземной разум
агент матрицы
энциклопедоед
ассоциативный биочип
филологический мнемоник
дитя инфоэры
петабайтоголовый
тиран нейронов
фотонный процессор
секретная разработка
молниеносный клавобой
ангел викторины
великий дух познания
вселенское сознание
загадочная мыслящая субстанция
комбинатор смыслов
запредельный талантище
зашкаливший интеллект
IQ-бомба
клон Эйнштейна
высший эталон разума
уникальное явление
невероятный мозголом
необъяснимый феномен
классик викторинизма
героический эрудит
достояние викторины
гений игры


 */

